# Setup

In [2]:
import numpy as np
import pandas as pd

# Exercise 1

With the earthquakes.csv file, select all the earthquakes in Japan with a
magnitude of 4.9 or greater using the mb magnitude type.

In [3]:
quakes = pd.read_csv('exercises/earthquakes.csv')

filteredQuakes = quakes\
    .loc[quakes.place.str.contains('Japan')]\
    .loc[quakes.mag >= 4.9]\
    .loc[quakes.magType == 'mb']

filteredQuakes.head()

,mag,magType,time,place,tsunami,parsed_place
1563,4.9,mb,1538977532250,"293km ESE of Iwo Jima, Japan",0,Japan
2576,5.4,mb,1538697528010,"37km E of Tomakomai, Japan",0,Japan
3072,4.9,mb,1538579732490,"15km ENE of Hasaki, Japan",0,Japan
3632,4.9,mb,1538450871260,"53km ESE of Hitachi, Japan",0,Japan

# Exercise 2

Create bins for each full number of earthquake magnitude (for instance, the first bin
is (0, 1], the second is (1, 2], and so on) with the ml magnitude type and count how
many are in each bin.

In [4]:
binnedQuakes = quakes\
        .query("magType == 'ml'")\
        .assign(
                mag_binned=lambda x: pd.cut(
                        x.mag, 
                        bins=np.arange(0, 7)
                )
        )\

binnedQuakes['mag_binned'].value_counts()

(1, 2]    3105
(0, 1]    2207
(2, 3]     862
(3, 4]     122
(4, 5]       2
(5, 6]       1
Name: mag_binned, dtype: int64

# Exercise 3

Using the faang.csv file, group by the ticker and resample to monthly frequency.
Make the following aggregations:
- Mean of the opening price
- Maximum of the high price
- Minimum of the low price
- Mean of the closing price
- Sum of the volume traded

In [40]:
faang = pd.read_csv(
    'exercises/faang.csv', 
    index_col='date',
    parse_dates=True
)

groupedFaang = faang\
    .groupby(['ticker', pd.Grouper(freq='M')])\
    .agg(
        {
        'open': np.mean,
        'high': np.max,
        'low': np.min,
        'close': np.mean,
        'volume': np.sum
        }
    )

groupedFaang.head()

                        open       high        low      close        volume
ticker date
AAPL   2018-01-31  43.505357  45.025002  41.174999  43.501309  2.638718e+09
       2018-02-28  41.819079  45.154999  37.560001  41.909737  3.711577e+09
       2018-03-31  43.761786  45.875000  41.235001  43.624048  2.854911e+09
       2018-04-30  42.441310  44.735001  40.157501  42.458572  2.664617e+09
       2018-05-31  46.239091  47.592499  41.317501  46.384205  2.483905e+09

# Exercise 4

Build a crosstab with the earthquake data between the tsunami column and the
magType column. Rather than showing the frequency count, show the maximum
magnitude that was observed for each combination. Put the magnitude type along
the columns.

In [52]:
crosstabQuakes = pd.crosstab(
    index=quakes.tsunami, 
    columns=quakes.magType,
    colnames=['magType'], 
    values=quakes.mag, 
    aggfunc=np.max
)

crosstabQuakes.head()

magType   mb  mb_lg    md   mh   ml  ms_20    mw  mwb  mwr  mww
tsunami
0        5.6    3.5  4.11  1.1  4.2    NaN  3.83  5.8  4.8  6.0
1        6.1    NaN   NaN  NaN  5.1    5.7  4.41  NaN  NaN  7.5

# Exercise 5

Calculate the rolling 60-day aggregations of the OHLC data by ticker for the
FAANG data. Use the same aggregations as exercise 3.

In [92]:
rollingFaang = faang\
    .groupby('ticker')\
    .rolling('60D')\
    .agg(
        {
        'open': np.mean,
        'high': np.max,
        'low': np.min,
        'close': np.mean,
        'volume': np.sum
        }
    )

rollingFaang.loc[('FB')].head()

                  open        high         low       close      volume
date
2018-01-02  177.679993  181.580002  177.550003  181.419998  18151900.0
2018-01-03  179.779999  184.779999  177.550003  183.044998  35038500.0
2018-01-04  181.486664  186.210007  177.550003  183.473333  48919400.0
2018-01-05  182.512497  186.899994  177.550003  184.317501  62493900.0
2018-01-08  183.449997  188.899994  177.550003  185.110001  80488600.0

# Exercise 6

Create a pivot table of the FAANG data that compares the stocks. Put the ticker in
the rows and show the averages of the OHLC and volume traded data.

In [97]:
pivotFaang = faang.pivot_table(
    index='ticker',
    aggfunc=np.mean
)

pivotFaang

              close         high          low         open        volume
ticker
AAPL      47.263357    47.748526    46.795877    47.277859  1.360803e+08
AMZN    1641.726176  1662.839839  1619.840519  1644.072709  5.648994e+06
FB       171.510956   173.613347   169.303148   171.472948  2.765860e+07
GOOG    1113.225134  1125.777606  1101.001658  1113.554101  1.741965e+06
NFLX     319.290319   325.219322   313.187330   319.620558  1.146962e+07

# Exercise 7

Calculate the Z-scores for each numeric column of Amazon's data ( ticker is
AMZN) in Q4 2018 using apply().

In [151]:
zscoresAMZN = faang.loc['2018-Q4']\
    .query('ticker==\'AMZN\'')\
    .drop(columns='ticker')\
    .apply(
        lambda x: (x - x.mean())/x.std()
    )

zscoresAMZN.head()

                high       low      open     close    volume
date
2018-10-01  2.368006  2.502113  2.337813  2.385848 -1.630411
2018-10-02  2.227302  2.247433  2.190795  2.155037 -0.861879
2018-10-03  2.058955  2.139987  2.068570  2.025489 -0.920345
2018-10-04  1.819474  1.781561  1.850048  1.722816 -0.126582
2018-10-05  1.628173  1.554416  1.642819  1.584748 -0.298771

# Exercise 8

Add event descriptions:

* Create a dataframe with the following three columns: ticker , date , and event. The columns should have the following values:

    - ticker : 'FB'
    - date : ['2018-07-25', '2018-03-19', '2018-03-20']
    - event : ['Disappointing user growth announced after close.', 'Cambridge Analytica story', 'FTC investigation']

* Set the index to ['date', 'ticker'] .

* Merge this data with the FAANG data using an outer join.

# Exercise 9

Use the transform() method on the FAANG data to represent all the
values in terms of the first date in the data. To do so, divide all the values for
each ticker by the values for the first date in the data for that ticker. This is
referred to as an index, and the data for the first date is the base ( https://
ec.europa.eu/eurostat/statistics-explained/index.php/
Beginners:Statistical_concept_-_Index_and_base_year ). When
data is in this format, we can easily see growth over time. Hint: transform() can
take a function name.

# Exercise 10

The European Centre for Disease Prevention and Control (ECDC) provides
an open dataset on COVID-19 cases called daily number of new reported cases
of COVID-19 by country worldwide ( https://www.ecdc.europa.eu/
en/publications-data/download-todays-data-geographic-
distribution-covid-19-cases-worldwide ). This dataset is updated daily,
but we will use a snapshot that contains data through September 18, 2020. Complete
the following tasks to practice the skills you've learned up to this point in the book:

* Prepare the data:
    - Read in the data in the covid19_cases.csv file.
    - Create a date column by parsing the dateRep column into a datetime.
    - Set the date column as the index.
    - Use the replace() method to update all occurrences of United_States_of_America and United_Kingdom to USA and UK, respectively.
    - Sort the index.

* For the five countries with the most cases (cumulative), find the day with the largest number of cases.
* Find the 7-day average change in COVID-19 cases for the last week in the data for the five countries with the most cases.
* Find the first date that each country other than China had cases.
* Rank the countries by cumulative cases using percentiles.

<hr>
<div style="overflow: hidden; margin-bottom: 10px;">
    <div style="float: left;">
        <a href="./python_101.ipynb">
            <button>Python 101</button>
        </a>
    </div>
    <div style="float: right;">
        <a href="../../solutions/ch_01/solutions.ipynb">
            <button>Solutions</button>
        </a>
        <a href="../ch_02/1-pandas_data_structures.ipynb">
            <button>Chapter 2 &#8594;</button>
        </a>
    </div>
</div>
<hr>